import os
#不知道 操作系统接口 (Operating System)。这里主要用来从系统里拿那个“保险箱”里的 API Key。
import chromadb
#引入工具，把文本转化为向量坐标
from dotenv import load_dotenv
#引入环境变量，目的是不把api写到主代码中
from openai import OpenAI
#引入openai中的OpenAI，具体做什么不知道

# 1. 准备工作
load_dotenv()
#加载环境变量
client = OpenAI(api_key=os.getenv("DEEPSEEK_API_KEY"), base_url="https://api.deepseek.com")
#创建用户，并填写apikey和网址
# client 是一个“对象”（你可以理解为拥有很多技能的 AI 秘书）。
# 它在初始化时记住了 api_key，所以后面我们直接指挥它干活，不用再传密码。
chroma_client = chromadb.PersistentClient(path="./chroma_db")
#创建chroma_client 并引用chromadb中的PersistentClient，连接到硬盘上的数据库文件。path="./chroma_db" 意思是告诉它数据存在当前目录下的 chroma_db 文件夹里。
#Persistent 的意思是 “持久化”（存硬盘，关机不丢）。如果你不写 path，它默认存在内存里，程序一关数据就没了
# chroma_client 也是一个“对象”（管理硬盘数据的管理员）。
# 它记住了 path="./chroma_db"，知道仓库在哪。

#不知道，这里调用了一个chromadb的get_collection功能，但是具体作用不太清楚
collection = chroma_client.get_collection(name="smartbrain_knowledge")
#启动页面的打印
print("🤖 SmartBrain RAG 系统已启动 (输入 'q' 退出)...")
#开始进入死循环
while True:
    #定义用户问题这个变量，先换行，再打印User > ，并用strip()去除用户在首位不小心多大的空格
    user_query = input("\nUser > ").strip()
    #如果用户没有输入，结束这次循环，进入下一次循环，目的是防止用户输入回车 导致输入内容为空
    if not user_query: continue
    #如果用户输入了大写的exit或者q，或小写本身，直接退出循环结束对话
    if user_query.lower() in ['q', 'exit']: break
    #用户输入了内容之后，打印正在检索
    print("🔍 正在检索知识库...")
    
    #这一行完全看不懂，好像是在根据用户的提问找知识库中匹配的内容
    results = collection.query(query_texts=[user_query], n_results=3)
    
    #这里用了拼接函数，但是为什么这么写不懂
    retrieved_text = "\n\n".join(results['documents'][0])
    #如果拼接内容为空，打印没有找到，并让 context_str = "（无已知信息）"
    if not retrieved_text:
        print("⚠️ 知识库里没找到相关内容，我将尝试直接回答。")
        context_str = "（无已知信息）"
    #如果找到了就让context_str = retrieved_text，但是 {len(results['documents'][0])}还是不懂
    else:
        # 打印出来给你自己看，方便调试 (上线时可以关掉)
        print(f"📖 找到了 {len(results['documents'][0])} 条参考资料，正在思考...")
        context_str = retrieved_text

    # 4. 这里应该是给ai的提示词，{context_str}是参考资料
    system_prompt = f"""
    你是一个专业的峡谷之巅客服助手。请严格根据下面的【参考资料】回答用户问题。
    如果资料里提到了具体时间（如1月8日），请务必准确回答。
    如果资料里没有答案，请说“知识库里没写，我也布吉岛”。

    【参考资料】：
    {context_str}
    """
    #这里是让ai回答并，应该格式是固定的，记住就好了
    response = client.chat.completions.create(
        model="deepseek-chat",
        messages=[
            {"role": "system", "content": system_prompt},
            {"role": "user", "content": user_query}
        ]
    )
    #这里说的找ai回答的逻辑不懂
    print(f"SmartBrain > {response.choices[0].message.content}")